AccumulationRegisters/Товары.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<AccumulationRegister>
		<Properties>
			<Name>Товары</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоУпаковок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МестоРазмещения</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НаправлениеДвиженияТовара</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДвиженияПланФакт</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДвиженияПланФакт</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/СтатусыЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Enum>
		<Properties>
			<Name>СтатусыЗаказов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ожидается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/РаботаСПартиями/Ext/Module.bsl
// ТарураевЕ { 1.0.2 # 01.03.2023
Процедура СоздатьПартииДокумента(Объект) Экспорт
	
	Для Каждого СтрокаТЧ Из Объект.СтрокиЗаказа Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.Партия) Тогда
			
			ПартияОбъект = Справочники.Партии.СоздатьЭлемент();
			ПартияОбъект.УстановитьНовыйКод();
			ПартияОбъект.Номенклатура = СтрокаТЧ.Номенклатура;
			ПартияОбъект.Записать();
			СтрокаТЧ.Партия = ПартияОбъект.Ссылка;
			
		КонецЕсли;
	КонецЦикла;
	Объект.Записать(РежимЗаписиДокумента.Запись);
	
Конецпроцедуры 

Процедура УдалитьПартию(СсылкаНаПартию, Статус) Экспорт
	
	Если Статус = Перечисления.СтатусыЗаказов.Завершен Тогда	
		Сообщить("Заказ завершён, партия не может быть удалена!");
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	// Очистить двжиения
	НовыйНаборЗаписей = РегистрыНакопления.Товары.СоздатьНаборЗаписей();
	НовыйНаборЗаписей.Отбор.Партия.Установить(СсылкаНаПартию);
	НовыйНаборЗаписей.Записать();
	
	ПартияОбъект = СсылкаНаПартию.ПолучитьОбъект();	
	
	ПартияОбъект.Удалить();
	УстановитьПривилегированныйРежим(Ложь);
	
Конецпроцедуры    
// }Тарураев
